testSB/src/InformationRegisters/ТарифыОбработкиХабов/ТарифыОбработкиХабов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыОбработкиХабов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СреднедневноеКоличествоГрузовыхМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

testSB/src/InformationRegisters/ТарифыОбработкиХабов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	МассивДанных = Новый Массив();

	МассивДанных.Добавить(Новый Структура("СреднедневноеКоличествоГрузовыхМест, Стоимость", 500, 500));
	МассивДанных.Добавить(Новый Структура("СреднедневноеКоличествоГрузовыхМест, Стоимость", 1000, 200));
	МассивДанных.Добавить(Новый Структура("СреднедневноеКоличествоГрузовыхМест, Стоимость", 2000, 100));
	МассивДанных.Добавить(Новый Структура("СреднедневноеКоличествоГрузовыхМест, Стоимость", 5000, 70));
	МассивДанных.Добавить(Новый Структура("СреднедневноеКоличествоГрузовыхМест, Стоимость", 9999999999, 50));

	ДатаЗаписи = Дата(2022, 08, 01);
			
	Для Каждого эл Из МассивДанных Цикл
		рег = РегистрыСведений.ТарифыОбработкиХабов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(рег, эл);
		рег.Период = ДатаЗаписи;
		рег.Записать(); 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
